#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.aws_subnet.private_subnet_a: Refreshing state... [id=subnet-06254fad976a8896b]
module.vpc.aws_vpc.kpinetworks_vpc: Refreshing state... [id=vpc-004b9544d0287a069]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=helloWorldHandler.zip]
module.policy.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_exec]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=eh5mzxa31b]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function]
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/minimal_lambda_function]
module.vpc.aws_subnet.private_subnet_b: Refreshing state... [id=subnet-050ac1709ec5cb3fc]
module.vpc.aws_security_group.kpinetworks_group: Refreshing state... [id=sg-079016f33dac97210]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=92o144]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-eh5mzxa31b-92o144-GET]
module.policy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=lambda_exec-20210910222023809000000001]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=minimal_lambda_function]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-eh5mzxa31b-92o144-GET]
module.network.aws_api_gateway_deployment.example: Refreshing state... [id=4m8lgd]
module.network.aws_api_gateway_stage.example: Refreshing state... [id=ags-eh5mzxa31b-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets.data.aws_s3_bucket_object.minimal_function_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "minimal_function_zip"  {
      + body                          = (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      ~ content_length                = 620 -> (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "b668e7996d5fca280d1b9325ebf84b38" -> (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      ~ id                            = "kpinetwork-backend/helloWorldHandler.zip" -> (known after apply)
      ~ last_modified                 = "Thu, 23 Sep 2021 14:49:55 UTC" -> (known after apply)
      ~ metadata                      = {} -> (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {} -> (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "b668e7996d5fca280d1b9325ebf84b38" -> "3b59d63eaa8cded3ca641b755a862edc"
        id                 = "helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "minimal_lambda_function"
      ~ last_modified                  = "2021-09-23T14:49:56.201+0000" -> (known after apply)
      ~ source_code_hash               = "2O7g4uOJ7sYYYlqkHUhSVxpOFIVxRt5DWUPHDgUElA0=" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_security_group.kpinetworks_group will be destroyed
  - resource "aws_security_group" "kpinetworks_group" {
      - arn                    = "arn:aws:ec2:us-west-2:435552912911:security-group/sg-079016f33dac97210" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "TCP"
              - from_port        = 5432
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - id                     = "sg-079016f33dac97210" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "TCP"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "kpinetwokrs_rds_group" -> null
      - owner_id               = "435552912911" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "kpinetwokrs_rds_group"
        } -> null
      - tags_all               = {
          - "Name" = "kpinetwokrs_rds_group"
        } -> null
      - vpc_id                 = "vpc-004b9544d0287a069" -> null
    }

  # module.vpc.aws_subnet.private_subnet_a will be destroyed
  - resource "aws_subnet" "private_subnet_a" {
      - arn                             = "arn:aws:ec2:us-west-2:435552912911:subnet/subnet-06254fad976a8896b" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-west-2a" -> null
      - availability_zone_id            = "usw2-az2" -> null
      - cidr_block                      = "10.0.1.0/24" -> null
      - id                              = "subnet-06254fad976a8896b" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "435552912911" -> null
      - tags                            = {
          - "Name" = "private-subnet-us-west-2a"
        } -> null
      - tags_all                        = {
          - "Name" = "private-subnet-us-west-2a"
        } -> null
      - vpc_id                          = "vpc-004b9544d0287a069" -> null
    }

  # module.vpc.aws_subnet.private_subnet_b will be destroyed
  - resource "aws_subnet" "private_subnet_b" {
      - arn                             = "arn:aws:ec2:us-west-2:435552912911:subnet/subnet-050ac1709ec5cb3fc" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-west-2b" -> null
      - availability_zone_id            = "usw2-az1" -> null
      - cidr_block                      = "10.0.2.0/24" -> null
      - id                              = "subnet-050ac1709ec5cb3fc" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "435552912911" -> null
      - tags                            = {
          - "Name" = "private-subnet-us-west-2b"
        } -> null
      - tags_all                        = {
          - "Name" = "private-subnet-us-west-2b"
        } -> null
      - vpc_id                          = "vpc-004b9544d0287a069" -> null
    }

  # module.vpc.aws_vpc.kpinetworks_vpc will be destroyed
  - resource "aws_vpc" "kpinetworks_vpc" {
      - arn                              = "arn:aws:ec2:us-west-2:435552912911:vpc/vpc-004b9544d0287a069" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_route_table_id           = "rtb-0e648a1e2a0d4f6b9" -> null
      - default_security_group_id        = "sg-0131c63644f6cd1d6" -> null
      - dhcp_options_id                  = "dopt-b03035c8" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-004b9544d0287a069" -> null
      - instance_tenancy                 = "default" -> null
      - owner_id                         = "435552912911" -> null
      - tags                             = {
          - "Name" = "kpinetworks_vpc"
        } -> null
      - tags_all                         = {
          - "Name" = "kpinetworks_vpc"
        } -> null
    }

Plan: 0 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*